Tekla Open API Reference for Tekla Structures 2025
ChangeData Class
 The ChangeData class presents information about the detected change of the modelobject in the model. It is instantiated inside the connected method.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.ChangeData
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ChangeData
<SerializableAttribute>
Public Class ChangeData
The ChangeData type exposes the following members.
Properties
Name | Description
Object
 Gets the changed object.
Source
 Gets the change source type.
Type
 Gets the change type.
Top
See Also
Reference
Tekla.Structures.Model Namespace